ХамелионЦРПТ/src/InformationRegisters/ХН_СоответствиеОперациямВводВОборот/ХН_СоответствиеОперациямВводВОборот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ХН_СоответствиеОперациямВводВОборот</name>
  <resources>
    <name>ОтчетОбИспользовании</name>
    <type>
      <types>DocumentRef.ВводВОборот_ХамелеонЦРПТ</types>
    </type>
  </resources>
  <dimensions>
    <name>ВводВОборот</name>
    <type>
      <types>DocumentRef.ВводВОборот_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ХамелионЦРПТ/src/InformationRegisters/ХН_СоотвествиеФайловВводуВОборот/ХН_СоотвествиеФайловВводуВОборот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ХН_СоотвествиеФайловВводуВОборот</name>
  <resources>
    <name>КоличествоКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РазмерФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Файл</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>GTIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПартии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПроизводства</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВводВОборот</name>
    <type>
      <types>DocumentRef.ВводВОборот_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ХамелионЦРПТ/src/Enums/ТипыДокументаВводВОборот_ХамелеонЦРПТ/ТипыДокументаВводВОборот_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДокументаВводВОборот_ХамелеонЦРПТ</name>
  <enumValues>
    <name>ВводВОборот</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотИмпорт</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотКонтракт</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотФизЛицо</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОбИспользовании</name>
  </enumValues>
  <enumValues>
    <name>МаркировкаОстатков</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотВозвратВРозницу</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОБоротаДляСобственныхНужд</name>
  </enumValues>
  <enumValues>
    <name>ВводВоборотТрансграничнаяТорговля</name>
  </enumValues>
  <enumValues>
    <name>НаТерриторииСтранЕАЭСКонтрактноеПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ИмпортСФТС</name>
  </enumValues>
</mdclass:Enum>

ХамелионЦРПТ/src/CommonModules/МВ_ОбщийМодуль_ВызовСервера/Module.bsl
Функция ПолучитьИмяПользователя() Экспорт 
	Возврат ПользователиИнформационнойБазы.ТекущийПользователь().Имя;	
КонецФункции

Функция ПолучитьФалыКМ_ОКТО()

	

КонецФункции // ПолучитьФалыКМ_ОКТО()

//Процедура для обработки события "ПриЗаписи" документов.
//
// Параметры:
//	Объект - Документ объект
//	Отказ - Отказ.
//
Процедура ПриЗаписи(Объект, Отказ) Экспорт

	Если Объект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТипЗначения = ТипЗнч(Объект);
		
	Если ТипЗначения = "" Тогда
		
	ИначеЕсли ТипЗначения = Тип("ДокументОбъект.ВводВОборот_ХамелеонЦРПТ") 
		И  Объект.ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВводВОборот")  Тогда
		ВводВОборот_ПриЗаписи(Объект, Отказ)
	//ИначеЕсли ТипЗначения = Тип("ДокументОбъект.ВводВОборот_ХамелеонЦРПТ") 
	//	И  Объект.ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ОтчетОбИспользовании")  Тогда
	//	ВводВОборотОтчетОбИспользовании_ПриЗаписи(Объект, Отказ)
	
	КонецЕсли;
	
КонецПроцедуры 

Процедура ВводВОборот_ПриЗаписи(Объект, Отказ)

	Если Объект.ДополнительныеСвойства.Свойство("НеЗаполнятьСоответствие") Тогда
		Возврат;	
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ДокОснование) И НЕ ТипЗнч(Объект.ДокОснование) = Тип("ДокументСсылка.ВводВОборот_ХамелеонЦРПТ") Тогда
		Возврат;
	КонецЕсли;	
	СсылкаНаОбъект = Объект.Ссылка;	
			
	НаборЗаписей = РегистрыСведений.ХН_СоответствиеОперациямВводВОборот.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВводВОборот.Установить(СсылкаНаОбъект);
	
	Если Объект.ПометкаУдаления Тогда
		
		НаборЗаписей.Записать();
		Возврат;
		
	КонецЕсли;
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.ОтчетОбИспользовании = Объект.ДокОснование;	
	НоваяЗапись.ВводВОборот =  СсылкаНаОбъект;	
//	НоваяЗапись.Дата 	 = Объект.Дата;
	Попытка
		НаборЗаписей.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	//РегДв=РегистрыСведений.СопоставлениеСправочниковДокументов_ХамелеонЦРПТ.СоздатьНаборЗаписей();
	//РегДв.Отбор.Справочник_Документ.Установить(Стр_1);
	//Добав=РегДв.Добавить();
	//Добав.Справочник_Документ=Стр_1;
	//Добав.СправочникДокумент_Меркурия=НовыйДокумент.Ссылка;
	//РегДв.Записать(Истина);

	
КонецПроцедуры 


Процедура ВводВОборотОтчетОбИспользовании_ПриЗагрузкеИзФайла(Объект, Отказ)

	Если Объект.ДополнительныеСвойства.Свойство("НеЗаполнятьСоответствие") Тогда
		Возврат;	
	КонецЕсли;
	//Если НЕ ЗначениеЗаполнено(Объект.ДокОснование) И НЕ ТипЗнч(Объект.ДокОснование) = Тип("ДокументСсылка.ВводВОборот_ХамелеонЦРПТ") Тогда
	//	Возврат;
	//КонецЕсли;	
	СсылкаНаОбъект = Объект.Ссылка;	
			
	НаборЗаписей = РегистрыСведений.ХН_СоотвествиеФайловВводуВОборот.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВводВОборот.Установить(СсылкаНаОбъект);
	
	Если Объект.ПометкаУдаления Тогда
		
		НаборЗаписей.Записать();
		Возврат;
		
	КонецЕсли;
	
//	НоваяЗапись = НаборЗаписей.Добавить();
//	//НоваяЗапись.ОтчетОбИспользовании = Объект.ДокОснование;	
//	НоваяЗапись.ВводВОборот =  СсылкаНаОбъект;	
////	НоваяЗапись.Дата 	 = Объект.Дата;
//	Попытка
//		НаборЗаписей.Записать();
//	Исключение
//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
//	КонецПопытки;
	
	//РегДв=РегистрыСведений.СопоставлениеСправочниковДокументов_ХамелеонЦРПТ.СоздатьНаборЗаписей();
	//РегДв.Отбор.Справочник_Документ.Установить(Стр_1);
	//Добав=РегДв.Добавить();
	//Добав.Справочник_Документ=Стр_1;
	//Добав.СправочникДокумент_Меркурия=НовыйДокумент.Ссылка;
	//РегДв.Записать(Истина);

	
КонецПроцедуры
